
<details><summary>Terraform Plan Output</summary>

```Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infrastructure relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infrastructure-for-event-driven-system/infrastructure-for-event-driven-system/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infrastructure-for-event-driven-system/infrastructure-for-event-driven-system

To view this run in a browser, visit:
https://app.terraform.io/app/pablosspot/event-driven-system-infrastructure-main/runs/run-wj83iyQ6XBdJFwU7

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_s3_bucket.docker_run_bucket: Refreshing state... [id=docker-run-bucket]
aws_sqs_queue.queue: Refreshing state... [id=https://sqs.ap-southeast-2.amazonaws.com/933392230433/event-driven-queue]
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:ap-southeast-2:933392230433:certificate/f1a86996-91f3-4121-b955-2b95938ab0b9]
aws_s3_bucket.thumbnail_bucket: Refreshing state... [id=event-driven-thumbnail-bucket]
aws_elastic_beanstalk_application.eb_app: Refreshing state... [id=event-driven-app]
aws_iam_role.ec2_role: Refreshing state... [id=event-driven-ec2-role]
aws_iam_instance_profile.ec2_eb_profile: Refreshing state... [id=event-driven-ec2-profile]
local_file.docker_run_config: Refreshing state... [id=e302cff298e53f9744f515477315e403cce39e2b]
aws_route53_record.validation_record["*.pablosspot.ml"]: Refreshing state... [id=Z08086882KIXUWHTYU1K1__a1d080dda80629adc3c60f9fd8bcf56c.pablosspot.ml._CNAME]
aws_route53_record.validation_record["pablosspot.ml"]: Refreshing state... [id=Z08086882KIXUWHTYU1K1__a1d080dda80629adc3c60f9fd8bcf56c.pablosspot.ml._CNAME]
aws_acm_certificate_validation.validation: Refreshing state... [id=2021-10-06 05:40:43 +0000 UTC]
aws_s3_bucket_policy.public_read: Refreshing state... [id=event-driven-thumbnail-bucket]
aws_s3_bucket_object.docker_run_object: Refreshing state... [id=5ebbd36fc7766dd83185f5709f689d847800b76d4427dc42b14d1432660ed1b5.zip]
aws_elastic_beanstalk_application_version.eb_version: Refreshing state... [id=5ebbd36fc7766dd83185f5709f689d847800b76d4427dc42b14d1432660ed1b5]
aws_elastic_beanstalk_environment.eb_env: Refreshing state... [id=e-gu2ejq6bkm]
aws_route53_record.endpoint: Refreshing state... [id=Z08086882KIXUWHTYU1K1_app_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_elastic_beanstalk_environment.eb_env has been changed
  ~ resource "aws_elastic_beanstalk_environment" "eb_env" {
        id                     = "e-gu2ejq6bkm"
        name                   = "event-driven-env"
      ~ solution_stack_name    = "64bit Amazon Linux 2 v3.4.6 running Docker" -> "64bit Amazon Linux 2018.03 v2.26.4 running Multi-container Docker 19.03.13-ce (Generic)"
        tags                   = {
            "created_by" = "terraform"
        }
      ~ version_label          = "5ebbd36fc7766dd83185f5709f689d847800b76d4427dc42b14d1432660ed1b5" -> "bf6fdca5d0bc7691784362fdaa4de414ec108306220c950c4b0c47f56e5d057c"
        # (16 unchanged attributes hidden)

        # (18 unchanged blocks hidden)
    }
  # local_file.docker_run_config has been deleted
  - resource "local_file" "docker_run_config" {
      - content              = <<-EOT
            "services":
              "backend":
                "env_file":
                - ".env"
                "image": "933392230433.dkr.ecr.ap-southeast-2.amazonaws.com/backend:2b8205c8"
                "ports":
                - "80:8000"
              "worker":
                "env_file":
                - ".env"
                "image": "933392230433.dkr.ecr.ap-southeast-2.amazonaws.com/worker:2b8205c8"
            "version": "2.4"
        EOT -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "./docker-compose.yml" -> null
      - id                   = "e302cff298e53f9744f515477315e403cce39e2b" -> null
    }
  # aws_s3_bucket_object.docker_run_object has been changed
  ~ resource "aws_s3_bucket_object" "docker_run_object" {
        id                     = "5ebbd36fc7766dd83185f5709f689d847800b76d4427dc42b14d1432660ed1b5.zip"
      + metadata               = {}
        tags                   = {
            "created_by" = "terraform"
        }
        # (11 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.docker_run will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "docker_run"  {
      ~ id                  = "d471dee337c3cce36d3cc5f3b397ffe1f1069d75" -> (known after apply)
      ~ output_base64sha256 = "vSjTmIcCtInSkc/RKCY/gJ3MnPOTKMLawcZmjfcJwyo=" -> (known after apply)
      ~ output_md5          = "3da1ee4a558f07850c867941ef9ca7c1" -> (known after apply)
      ~ output_sha          = "d471dee337c3cce36d3cc5f3b397ffe1f1069d75" -> (known after apply)
      ~ output_size         = 303 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_elastic_beanstalk_application_version.eb_version must be replaced
-/+ resource "aws_elastic_beanstalk_application_version" "eb_version" {
      ~ arn          = "arn:aws:elasticbeanstalk:ap-southeast-2:933392230433:applicationversion/event-driven-app/5ebbd36fc7766dd83185f5709f689d847800b76d4427dc42b14d1432660ed1b5" -> (known after apply)
      ~ id           = "5ebbd36fc7766dd83185f5709f689d847800b76d4427dc42b14d1432660ed1b5" -> (known after apply)
      ~ key          = "5ebbd36fc7766dd83185f5709f689d847800b76d4427dc42b14d1432660ed1b5.zip" -> (known after apply) # forces replacement
      ~ name         = "5ebbd36fc7766dd83185f5709f689d847800b76d4427dc42b14d1432660ed1b5" -> "231b11f20d52d6e266ab2008b923a29a20b3c1da6ddf9fa630573f28683d4da7" # forces replacement
        tags         = {
            "created_by" = "terraform"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_elastic_beanstalk_environment.eb_env will be updated in-place
  ~ resource "aws_elastic_beanstalk_environment" "eb_env" {
        id                     = "e-gu2ejq6bkm"
        name                   = "event-driven-env"
      ~ solution_stack_name    = "64bit Amazon Linux 2018.03 v2.26.4 running Multi-container Docker 19.03.13-ce (Generic)" -> "64bit Amazon Linux 2 v3.4.6 running Docker"
        tags                   = {
            "created_by" = "terraform"
        }
      ~ version_label          = "bf6fdca5d0bc7691784362fdaa4de414ec108306220c950c4b0c47f56e5d057c" -> "231b11f20d52d6e266ab2008b923a29a20b3c1da6ddf9fa630573f28683d4da7"
        # (16 unchanged attributes hidden)

        # (18 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.docker_run_object must be replaced
-/+ resource "aws_s3_bucket_object" "docker_run_object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "3da1ee4a558f07850c867941ef9ca7c1" -> (known after apply)
      ~ id                     = "5ebbd36fc7766dd83185f5709f689d847800b76d4427dc42b14d1432660ed1b5.zip" -> (known after apply)
      ~ key                    = "5ebbd36fc7766dd83185f5709f689d847800b76d4427dc42b14d1432660ed1b5.zip" -> "231b11f20d52d6e266ab2008b923a29a20b3c1da6ddf9fa630573f28683d4da7.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
        tags                   = {
            "created_by" = "terraform"
        }
      + version_id             = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # local_file.docker_run_config will be created
  + resource "local_file" "docker_run_config" {
      + content              = <<-EOT
            "services":
              "backend":
                "env_file":
                - ".env"
                "image": "933392230433.dkr.ecr.ap-southeast-2.amazonaws.com/backend:4213e01e"
                "ports":
                - "80:8000"
              "worker":
                "env_file":
                - ".env"
                "image": "933392230433.dkr.ecr.ap-southeast-2.amazonaws.com/worker:4213e01e"
            "version": "3.8"
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./docker-compose.yml"
      + id                   = (known after apply)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

```

</details>
